---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLAngle.BoltSpacing1LongerFlange
source: html/b1c48866-e56e-62a8-04a0-c890c97e9fad.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLAngle.BoltSpacing1LongerFlange Property

Standard bolt spacing first row in the longer flange, in. (mm)

## Syntax (C#)
```csharp
public double BoltSpacing1LongerFlange { get; set; }
```